espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
  // Check key type and size.
  switch (alg) {
    case PSA_ALG_ECB_NO_PADDING:
    case PSA_ALG_CTR:
    case PSA_ALG_CFB:
    case PSA_ALG_OFB:
    case PSA_ALG_CCM_STAR_NO_TAG:
    case PSA_ALG_CBC_NO_PADDING:
    case PSA_ALG_CBC_PKCS7:
      if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
        return PSA_ERROR_NOT_SUPPORTED;
      }
      if (key_buffer_size < (psa_get_key_bits(attributes) / 8)
          || !(psa_get_key_bits(attributes) == 128
               || psa_get_key_bits(attributes) == 256)) {
        return PSA_ERROR_NOT_SUPPORTED;
      }
      break;
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  if (input_length == 0) {
    // We don't need to do anything if the input length is zero.
    *output_length = 0;
    return PSA_SUCCESS;
  }

  // Our drivers only support full or no overlap between input and output
  // buffers. So in the case of partial overlap, copy the input buffer into
  // the output buffer and process it in place as if the buffers fully
  // overlapped.
  if ((output > input) && (output < (input + input_length))) {
    // Sanity check before copying. Some ciphers have a stricter requirement
    // than this (if an IV is included), but no ciphers will have an output
    // smaller than the input.
    if (output_size < input_length) {
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    memmove(output, input, input_length);
    input = output;
  }

  size_t key_len = psa_get_key_bits(attributes) / 8;

  psa_status_t status = PSA_ERROR_HARDWARE_FAILURE;

#if defined(MBEDTLS_PSA_CRYPTO_C)         \
  && (defined(PSA_WANT_ALG_CTR)           \
  || defined(PSA_WANT_ALG_CFB)            \
  || defined(PSA_WANT_ALG_OFB)            \
  || defined(PSA_WANT_ALG_CCM)            \
  || defined(PSA_WANT_ALG_CBC_NO_PADDING) \
  || defined(PSA_WANT_ALG_CBC_PKCS7))
  uint8_t temp_iv[16];
#endif

  switch (alg) {
#if defined(PSA_WANT_ALG_ECB_NO_PADDING)
    case PSA_ALG_ECB_NO_PADDING:
      // Check buffer sizes
      if (output_size < input_length) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      // We cannot do ECB on non-block sizes
      if (input_length % 16 != 0) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      for (size_t i = 0; i < input_length; i += 16) {
        // Encrypt each block independently
        status = sl_crypto_aes_crypt_ecb_single(key_buffer,
                                                key_len,
                                                PSA_CRYPTO_DRIVER_ENCRYPT,
                                                &input[i],
                                                &output[i]);
        if (status != PSA_SUCCESS) {
          goto exit;
        }
      }

      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_ECB_NO_PADDING
#if defined(MBEDTLS_PSA_CRYPTO_C)
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM_STAR_NO_TAG:
      // Explicit fallthrough
#endif
#if defined(PSA_WANT_ALG_CTR) || defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CTR:
      // Check buffer sizes
      if (output_size < input_length) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
#if defined(PSA_WANT_ALG_CCM)
      if (alg == PSA_ALG_CCM_STAR_NO_TAG) {
        if (iv_length != 13) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }

        // AES-CCM*-no-tag is basically AES-CTR with preformatted IV
        temp_iv[0] = 1;
        memcpy(&temp_iv[1], iv, 13);
        temp_iv[14] = 0;
        temp_iv[15] = 1;
      } else
#endif
      {
        if (iv_length != 16) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }

        memcpy(temp_iv, iv, 16);
      }

      uint8_t tmp_buf[16];

      // Do encryption
      status = sl_crypto_aes_crypt_ctr(key_buffer,
                                       key_len,
                                       input_length,
                                       NULL,
                                       temp_iv,
                                       tmp_buf,
                                       input,
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_CTR || PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_CFB)
    case PSA_ALG_CFB:
      // Check buffer sizes
      if (output_size < input_length) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      if (iv_length != 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      memcpy(temp_iv, iv, 16);

      // Do encryption
      status = sl_crypto_aes_crypt_cfb128(key_buffer,
                                          key_len,
                                          PSA_CRYPTO_DRIVER_ENCRYPT,
                                          input_length,
                                          NULL,
                                          temp_iv,
                                          input,
                                          output);
      if (status != PSA_SUCCESS) {
        goto exit;
      }

      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_CFB
#if defined(PSA_WANT_ALG_OFB)
    case PSA_ALG_OFB:
      // Check buffer sizes
      if (output_size < input_length) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      if (iv_length != 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      memcpy(temp_iv, iv, 16);

      // Do encryption
      status = sl_crypto_aes_crypt_ofb(key_buffer,
                                       key_len,
                                       input_length,
                                       NULL,
                                       temp_iv,
                                       input,
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_OFB
#if defined(PSA_WANT_ALG_CBC_NO_PADDING) || defined(PSA_WANT_ALG_CBC_PKCS7)
    case PSA_ALG_CBC_NO_PADDING:
      // We cannot do CBC without padding on non-block sizes.
      if (input_length % 16 != 0) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
    // Fall-through
    case PSA_ALG_CBC_PKCS7:
      // Check buffer sizes
      if (alg == PSA_ALG_CBC_NO_PADDING) {
        if (output_size < input_length) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
      } else {
        if (output_size < ((input_length & ~0xF) + 16)) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
      }

      if (iv_length != 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      memcpy(temp_iv, iv, 16);

      // Store the final block before encryption to prevent it from
      // being overwritten. The internal buffer in sl_crypto_aes_crypt_cbc
      // isn't retained across calls.
      uint8_t final_block[16];
      memcpy(final_block, &input[input_length & ~0xF], input_length & 0xF);

      // CBC-encrypt all but the last block
      status = sl_crypto_aes_crypt_cbc(key_buffer,
                                       key_len,
                                       PSA_CRYPTO_DRIVER_ENCRYPT,
                                       input_length & ~0xF,
                                       temp_iv,
                                       input,
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      // Process final block, if any
      if (alg == PSA_ALG_CBC_PKCS7) {
        // Add PKCS padding
        memset(&final_block[input_length & 0xF],
               16 - (input_length & 0xF),
               16 - (input_length & 0xF));

        if (input_length >= 16) {
          memcpy(temp_iv, &output[(input_length & ~0xF) - 16], 16);
        }

        // CBC-encrypt the last block
        status = sl_crypto_aes_crypt_cbc(key_buffer,
                                         key_len,
                                         PSA_CRYPTO_DRIVER_ENCRYPT,
                                         16,
                                         temp_iv,
                                         final_block,
                                         final_block);
        // Copy to output
        memcpy(&output[(input_length & ~0xF)], final_block, 16);
        *output_length = (input_length & ~0xF) + 16;
      } else {
        *output_length = input_length;
      }
      break;
#endif // PSA_WANT_ALG_CBC_PKCS7 || PSA_WANT_ALG_CBC_NO_PADDING
#endif /* MBEDTLS_PSA_CRYPTO_C */
    default:
      (void)attributes;
      (void)key_buffer;
      (void)key_buffer_size;
      (void)alg;
      (void)iv;
      (void)iv_length;
      (void)input;
      (void)input_length;
      (void)output;
      (void)output_size;
      (void)output_length;
      return PSA_ERROR_NOT_SUPPORTED;
  }

