espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
      for (size_t i = 0; i < input_length; i += 16) {
        // Decrypt each block independently using ECB
        status = sl_crypto_aes_crypt_ecb_single(dec_key,
                                                key_len,
                                                PSA_CRYPTO_DRIVER_DECRYPT,
                                                &input[i],
                                                &output[i]);
        if (status != PSA_SUCCESS) {
          goto exit;
        }
      }

      memset(dec_key, 0, 32);
      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_ECB_NO_PADDING
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM_STAR_NO_TAG:
      // Explicit fallthrough
#endif
#if defined(PSA_WANT_ALG_CTR) || defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CTR:
      // Check buffer sizes
#if defined(PSA_WANT_ALG_CCM)
      if (alg == PSA_ALG_CCM_STAR_NO_TAG) {
        if (output_size < input_length - 13) {
          return PSA_ERROR_BUFFER_TOO_SMALL;
        }

        // AES-CCM*-no-tag is basically AES-CTR with preformatted IV
        temp_iv[0] = 1;
        memcpy(&temp_iv[1], input, 13);
        temp_iv[14] = 0;
        temp_iv[15] = 1;
        input += 13;
        input_length -= 13;
      } else
#endif
      {
        if (output_size < input_length - 16) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }

        memcpy(temp_iv, input, 16);
        input += 16;
        input_length -= 16;
      }

      // Do decryption
      status = sl_crypto_aes_crypt_ctr(key_buffer,
                                       key_len,
                                       input_length,
                                       NULL,
                                       temp_iv,
                                       temp_iv,
                                       input,
                                       output);

      *output_length = input_length;
      break;
#endif // PSA_WANT_ALG_CTR || PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_OFB)
    case PSA_ALG_OFB:
      // Check buffer sizes
      if (output_size < input_length - 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      memcpy(temp_iv, input, 16);

      // Do decryption
      status = sl_crypto_aes_crypt_ofb(key_buffer,
                                       key_len,
                                       input_length,
                                       NULL,
                                       temp_iv,
                                       &input[16],
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      *output_length = input_length - 16;
      break;
#endif // PSA_WANT_ALG_OFB
#if defined(PSA_WANT_ALG_CFB)
    case PSA_ALG_CFB:
      // Check buffer sizes
      if (output_size < input_length - 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      memcpy(temp_iv, input, 16);

      // Do decryption
      status = sl_crypto_aes_crypt_cfb128(key_buffer,
                                          key_len,
                                          PSA_CRYPTO_DRIVER_DECRYPT,
                                          input_length - 16,
                                          NULL,
                                          temp_iv,
                                          &input[16],
                                          output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      *output_length = input_length - 16;
      break;
#endif // PSA_WANT_ALG_CFB
#if defined(PSA_WANT_ALG_CBC_NO_PADDING) || defined(PSA_WANT_ALG_CBC_PKCS7)
    case PSA_ALG_CBC_NO_PADDING:
    // Fall-through
    case PSA_ALG_CBC_PKCS7:
      // We cannot do CBC without padding on non-block sizes.
      if (input_length % 16 != 0) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      size_t full_blocks;
      if (alg == PSA_ALG_CBC_NO_PADDING) {
        if (output_size < input_length - 16) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
        full_blocks = (input_length - 16) / 16;
      } else {
        // check output has enough room for at least n-1 blocks
        if (input_length < 32
            || ((input_length & 0xF) != 0)
            || output_size < (input_length - 32)) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
        full_blocks = (input_length - 32) / 16;
      }

      // Generate decryption key
      status = sl_crypto_aes_get_decryption_key(key_buffer, key_len, dec_key, key_len);
      if (status != PSA_SUCCESS) {
        return status;
      }

      // CBC-decrypt all but the last block
      memcpy(temp_iv, input, 16);
      status = sl_crypto_aes_crypt_cbc(dec_key,
                                       key_len,
                                       PSA_CRYPTO_DRIVER_DECRYPT,
                                       full_blocks * 16,
                                       temp_iv,
                                       &input[16],
                                       output);

      if (status != PSA_SUCCESS) {
        memset(dec_key, 0, 32);
        goto exit;
      }

      // Process final block, if any
      if (alg == PSA_ALG_CBC_PKCS7) {
        uint8_t final_block[16];
        memcpy(final_block, &input[input_length - 16], 16);

        // CBC-decrypt the last block
        memcpy(temp_iv, &input[full_blocks * 16], 16);
        status = sl_crypto_aes_crypt_cbc(dec_key,
                                         key_len,
                                         PSA_CRYPTO_DRIVER_DECRYPT,
                                         16,
                                         temp_iv,
                                         final_block,
                                         final_block);
        if (status != PSA_SUCCESS) {
          goto exit;
        }

        sli_psa_zeroize(dec_key, 32);

        // Check how many bytes of padding to subtract
        uint8_t pad_bytes = final_block[15];

        // Check all padding bytes
        status = sli_psa_validate_pkcs7_padding(final_block,
                                                16,
                                                pad_bytes);
        if (status != PSA_SUCCESS) {
          goto exit;
        }

