espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
    // We know we'll be computing and outputing at least the completed streaming block
    size_t output_blocks = 1;

    if (input_length > bytes_to_boundary) {
      // plus however many full blocks are left over after filling the stream buffer
      output_blocks += (input_length - bytes_to_boundary) / 16;
      // If we're caching and the sum of already-input and to-be-input data
      // ends up at a block boundary, we won't be outputting the last block
      if (cache_full_block && ((input_length - bytes_to_boundary) % 16 == 0)) {
        output_blocks -= 1;
      }
    }

    if (output_size < (output_blocks * 16)) {
      return PSA_ERROR_BUFFER_TOO_SMALL;
    }
  } else {
    // Early failure if output buffer is too small
    if (output_size < input_length) {
      return PSA_ERROR_BUFFER_TOO_SMALL;
    }
  }

  // Our drivers only support full or no overlap between input and output
  // buffers. So in the case of partial overlap, copy the input buffer into
  // the output buffer and process it in place as if the buffers fully
  // overlapped.
  if ((output > input) && (output < (input + input_length))) {
    // Sanity check before copying. Some ciphers have a stricter requirement
    // than this (if an IV is included), but no ciphers will have an output
    // smaller than the input.
    if (output_size < input_length) {
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    memmove(output, input, input_length);
    input = output;
  }

  switch (operation->alg) {
#if defined(PSA_WANT_ALG_ECB_NO_PADDING)
    case PSA_ALG_ECB_NO_PADDING:
    {
      // Read in up to full streaming input block
      if (bytes_to_boundary != 16) {
        memcpy(&operation->streaming_block[operation->processed_length % 16],
               input,
               bytes_to_boundary);
        input += bytes_to_boundary;
        input_length -= bytes_to_boundary;

        status = sl_crypto_aes_crypt_ecb_single(operation->key,
                                                operation->key_len,
                                                operation->direction,
                                                operation->streaming_block,
                                                output);
        if (status != PSA_SUCCESS) {
          goto exit;
        }

        output += 16;
        actual_output_length += 16;
        operation->processed_length += bytes_to_boundary;
      }

      // Do multi-block operation if applicable
      if (input_length >= 16) {
        size_t operation_size = (input_length / 16) * 16;

        for (size_t i = 0; i < operation_size; i += 16) {
          status = sl_crypto_aes_crypt_ecb_single(operation->key,
                                                  operation->key_len,
                                                  operation->direction,
                                                  input,
                                                  output);
          if (status != PSA_SUCCESS) {
            goto exit;
          }

          input += 16;
          input_length -= 16;
          output += 16;
          actual_output_length += 16;
          operation->processed_length += 16;
        }
      }

      // What's left over in the input buffer will be cleaned up after switch-case
      break;
    }
#endif // PSA_WANT_ALG_ECB_NO_PADDING
#if defined(PSA_WANT_ALG_CBC_NO_PADDING) || defined(PSA_WANT_ALG_CBC_PKCS7)
    case PSA_ALG_CBC_NO_PADDING:
    case PSA_ALG_CBC_PKCS7:
    {
      if (bytes_to_boundary != 16) {
        memcpy(&operation->streaming_block[operation->processed_length % 16],
               input,
               bytes_to_boundary);

        if (cache_full_block && (bytes_to_boundary == input_length)) {
          // Don't process the streaming block if there is no more input data
          status = PSA_SUCCESS;
        } else {
          status = sl_crypto_aes_crypt_cbc(operation->key,
                                           operation->key_len,
                                           operation->direction,
                                           16,
                                           operation->iv,
                                           operation->streaming_block,
                                           output);
          if (status != PSA_SUCCESS) {
            goto exit;
          }
          output += 16;
          actual_output_length += 16;
        }

        input += bytes_to_boundary;
        input_length -= bytes_to_boundary;
        operation->processed_length += bytes_to_boundary;
      } else if (input_length > 0
                 && cache_full_block
                 && operation->processed_length > 0) {
        // We know there's processing to be done, and that we haven't processed
        // the full block in the streaming buffer yet. Process it now.
        status = sl_crypto_aes_crypt_cbc(operation->key,
                                         operation->key_len,
                                         operation->direction,
                                         16,
                                         operation->iv,
                                         operation->streaming_block,
                                         output);
        if (status != PSA_SUCCESS) {
          goto exit;
        }
        output += 16;
        actual_output_length += 16;
      }

      // Do multi-block operation if applicable
      if (input_length >= 16) {
        size_t operation_size = (input_length / 16) * 16;

        if (cache_full_block && (input_length % 16 == 0)) {
          // Don't decrypt the last block until finish is called, so that we
          // can properly remove the padding before returning it.
          operation_size -= 16;
        }

        if (operation_size > 0) {
          status = sl_crypto_aes_crypt_cbc(operation->key,
                                           operation->key_len,
                                           operation->direction,
                                           operation_size,
                                           operation->iv,
                                           input,
                                           output);

          if (status != PSA_SUCCESS) {
            goto exit;
          }
        } else {
          status = PSA_SUCCESS;
        }

        input += operation_size;
        input_length -= operation_size;
        actual_output_length += operation_size;
        operation->processed_length += operation_size;
      }

      // What's left over in the input buffer will be cleaned up after switch-case
      break;
    }
#endif // PSA_WANT_ALG_CBC_PKCS7 || PSA_WANT_ALG_CBC_NO_PADDING
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CCM_STAR_NO_TAG:
      // Explicit fallthrough
#endif // PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_CTR) || defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_CTR:
    {
      size_t offset = operation->processed_length % 16;

      status = sl_crypto_aes_crypt_ctr(operation->key,
                                       operation->key_len,
                                       input_length,
                                       &offset,
                                       operation->iv,
                                       operation->streaming_block,
                                       input,
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      actual_output_length += input_length;
      operation->processed_length += input_length;
      input_length -= input_length;

      break;
    }
#endif // PSA_WANT_ALG_CTR || PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_CFB)
    case PSA_ALG_CFB:
    {
      size_t offset = operation->processed_length % 16;

      status = sl_crypto_aes_crypt_cfb128(operation->key,
                                          operation->key_len,
                                          operation->direction,
                                          input_length,
                                          &offset,
                                          operation->iv,
                                          input,
                                          output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      actual_output_length += input_length;
      operation->processed_length += input_length;
      input_length -= input_length;

      break;
    }
#endif // PSA_WANT_ALG_CFB
#if defined(PSA_WANT_ALG_OFB)
    case PSA_ALG_OFB:
    {
      size_t offset = operation->processed_length % 16;

      status = sl_crypto_aes_crypt_ofb(operation->key,
                                       operation->key_len,
                                       input_length,
                                       &offset,
                                       operation->iv,
                                       input,
                                       output);

      if (status != PSA_SUCCESS) {
        goto exit;
      }

      actual_output_length += input_length;
      operation->processed_length += input_length;
      input_length -= input_length;

      break;
    }
#endif // PSA_WANT_ALG_OFB
    default:
      return PSA_ERROR_BAD_STATE;
  }

  // If there's anything left in the input buffer, copy it to the context
  // This'll only be the case for lagging ciphers
  if (input_length > 0) {
    if (!lagging
        || (input_length >= 16 && !cache_full_block)
        || (input_length > 16 && cache_full_block)) {
      *output_length = 0;
      return PSA_ERROR_BAD_STATE;
    }

    memcpy(operation->streaming_block,
           input,
           input_length);
    operation->processed_length += input_length;
  }

