espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
/*
 * Store a decryption key in out_key based on the in_key.
 *
 * This is needed for ECB and CBC since the CRYPTO accelerator cannot decrypt
 * directly with the normal key, but rather needs a particular decrypt key that
 * it generates itself after one round of encryption.
 */
static psa_status_t sl_crypto_aes_get_decryption_key(const uint8_t *in_key,
                                                     size_t in_key_size,
                                                     uint8_t *out_key,
                                                     size_t out_key_size)
{
  CORE_DECLARE_IRQ_STATE;

  if (in_key == NULL
      || out_key == NULL
      || out_key_size != in_key_size) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              in_key,
                              (in_key_size == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  CORE_EXIT_CRITICAL();

  // We need to perform one encrypt operation in order to get the
  // proper decryption key.
  device->CMD = CRYPTO_CMD_INSTR_AESENC;
  while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0UL) {
    // Wait for operation to complete
  }

  CORE_ENTER_CRITICAL();
  CRYPTO_KeyReadUnaligned(device,
                          out_key,
                          (out_key_size == 16U) ? cryptoKey128Bits
                          : cryptoKey256Bits);
  CORE_EXIT_CRITICAL();

  crypto_management_release(device);

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_AES && PSA_WANT_KEY_TYPE_*

#if defined(PSA_WANT_KEY_TYPE_AES) \
  && (defined(PSA_WANT_ALG_ECB_NO_PADDING) || defined(PSA_WANT_ALG_OFB))

/*
 * AES-ECB encryption/decryption of a single block
 */
static psa_status_t sl_crypto_aes_crypt_ecb_single(const uint8_t *key_buffer,
                                                   size_t key_buffer_size,
                                                   psa_encrypt_or_decrypt_t mode,
                                                   const uint8_t input[16],
                                                   uint8_t output[16])
{
  CORE_DECLARE_IRQ_STATE;

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  // Write input data to accelerator
  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              key_buffer,
                              (key_buffer_size == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)input);
  CORE_EXIT_CRITICAL();

  if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
    device->CMD = CRYPTO_CMD_INSTR_AESENC;
  } else {
    device->CMD = CRYPTO_CMD_INSTR_AESDEC;
  }

  while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0UL) {
    // Wait for the operation to complete
  }

  CORE_ENTER_CRITICAL();
  CRYPTO_DataReadUnaligned(&device->DATA0, (uint8_t *)output);
  CORE_EXIT_CRITICAL();

  crypto_management_release(device);

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_AES && (PSA_WANT_KEY_TYPE_ECB_NO_PADDING || PSA_WANT_ALG_OFB)

#if defined(PSA_WANT_KEY_TYPE_AES)         \
  && (defined(PSA_WANT_ALG_CBC_NO_PADDING) \
  || defined(PSA_WANT_ALG_CBC_PKCS7))

/*
 * AES-CBC buffer encryption/decryption
 */
static psa_status_t sl_crypto_aes_crypt_cbc(const uint8_t *key_buffer,
                                            size_t key_buffer_size,
                                            psa_encrypt_or_decrypt_t mode,
                                            size_t length,
                                            uint8_t iv[16],
                                            const uint8_t *input,
                                            uint8_t *output)
{
  CORE_DECLARE_IRQ_STATE;
  size_t processed = 0;

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  // Set the encryption/decryption key and input data
  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              key_buffer,
                              (key_buffer_size == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
    CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)iv);
  } else {
    CRYPTO_DataWriteUnaligned(&device->DATA2, (uint8_t *)iv);
  }
  CORE_EXIT_CRITICAL();

  uint8_t output_buffer[16] = { 0 };

  while (processed < length) {
    if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0XOR, (uint8_t *)(&input[processed]));

      // Initiate encryption and wait for it to complete
      device->CMD = CRYPTO_CMD_INSTR_AESENC;
      while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;

      // Flush the output buffer for each block
      if (processed >= 16) {
        memcpy(&output[processed - 16], output_buffer, 16);
      }

      CRYPTO_DataReadUnaligned(&device->DATA0, output_buffer);
      CORE_EXIT_CRITICAL();
    } else {
      // Decrypt input block, XOR IV to decrypted text, set ciphertext as next IV
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)(&input[processed]));

      // Initiate decryption sequence and wait for it to complete
      CRYPTO_EXECUTE_4(device,
                       CRYPTO_CMD_INSTR_DATA0TODATA1,
                       CRYPTO_CMD_INSTR_AESDEC,
                       CRYPTO_CMD_INSTR_DATA2TODATA0XOR,
                       CRYPTO_CMD_INSTR_DATA1TODATA2);

      while ((device->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;

      // The output pointer will be before the input pointer on single-shot
      // decrypt (and at the same point for multi-part), so we don't need
      // to use the output buffer.
      CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
      CORE_EXIT_CRITICAL();
    }
    processed += 16;
  }

  if (processed >= 16) {
    if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
      // Flush the output buffer and update the supplied IV
      memcpy(&output[processed - 16], output_buffer, 16);
      memcpy(iv, &output[processed - 16], 16);
    } else {
      CORE_ENTER_CRITICAL();
      // Update the supplied IV
      CRYPTO_DataReadUnaligned(&device->DATA2, iv);
      CORE_EXIT_CRITICAL();
    }
  }

  crypto_management_release(device);

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_AES && PSA_WANT_KEY_TYPE_CBC_*

#if defined(PSA_WANT_KEY_TYPE_AES) && defined(PSA_WANT_ALG_CFB)

