espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
/*
 * AES-CFB128 buffer encryption/decryption
 */
static psa_status_t sl_crypto_aes_crypt_cfb128(const uint8_t *key_buffer,
                                               size_t key_buffer_size,
                                               psa_encrypt_or_decrypt_t mode,
                                               size_t length,
                                               size_t *iv_off,
                                               uint8_t iv[16],
                                               const uint8_t *input,
                                               uint8_t *output)
{
  size_t n = iv_off ? *iv_off : 0;
  size_t processed = 0;
  CORE_DECLARE_IRQ_STATE;

  if (n > 15) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  uint8_t output_buffer[16] = { 0 };

  while (processed < length) {
    if (n > 0) {
      // Start by filling up the IV
      if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
        iv[n] = (uint8_t)(iv[n] ^ input[processed]);
        output[processed] = iv[n];
      } else {
        uint8_t c = input[processed];
        output[processed] = (uint8_t)(c ^ iv[n]);
        iv[n] = (uint8_t) c;
      }
      n = (n + 1) & 0x0F;
      processed++;
      continue;
    } else {
      // Process one ore more blocks of data
      CRYPTO_TypeDef *device = crypto_management_acquire();
      device->WAC = 0;
      device->CTRL = 0;

      CORE_ENTER_CRITICAL();
      CRYPTO_KeyBufWriteUnaligned(device,
                                  key_buffer,
                                  (key_buffer_size == 16U) ? cryptoKey128Bits
                                  : cryptoKey256Bits);
      CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)iv);
      CORE_EXIT_CRITICAL();

      // Encryption: encrypt IV, encIV xor input -> output and IV
      // Decryption: encrypt IV, encIV xor input -> output, input -> IV
      size_t iterations = (length - processed) / 16;
      for (size_t i = 0; i < iterations; i++ ) {
        device->CMD = CRYPTO_CMD_INSTR_AESENC;
        while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;

        CORE_ENTER_CRITICAL();
        if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
          CRYPTO_DataWriteUnaligned(&device->DATA0XOR,
                                    (uint8_t *)(&input[processed]));
          // Flush the output buffer
          if (processed >= 16) {
            memcpy(&output[processed - 16], output_buffer, 16);
          }
          CRYPTO_DataReadUnaligned(&device->DATA0, output_buffer);
        } else {
          CRYPTO_DataWriteUnaligned(&device->DATA1,
                                    (uint8_t *)(&input[processed]));
          device->CMD = CRYPTO_CMD_INSTR_DATA1TODATA0XOR;
          // Flush the output buffer
          if (processed >= 16) {
            memcpy(&output[processed - 16], output_buffer, 16);
          }
          CRYPTO_DataReadUnaligned(&device->DATA0, output_buffer);
          device->CMD = CRYPTO_CMD_INSTR_DATA1TODATA0;
        }
        CORE_EXIT_CRITICAL();
        processed += 16;
      }

      CORE_ENTER_CRITICAL();
      CRYPTO_DataReadUnaligned(&device->DATA0, iv);
      CORE_EXIT_CRITICAL();

      // Create a buffer for the last input block
      uint8_t input_buffer[16];
      memcpy(input_buffer, &input[processed], 16);

      // Flush the output buffer
      if (processed >= 16) {
        memcpy(&output[processed - 16], output_buffer, 16);
      }

      while (length - processed > 0) {
        if (n == 0) {
          device->CMD = CRYPTO_CMD_INSTR_AESENC;
          while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;
          CORE_ENTER_CRITICAL();
          CRYPTO_DataReadUnaligned(&device->DATA0, iv);
          CORE_EXIT_CRITICAL();
        }

        // Save remainder to iv
        if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
          output[processed] = (uint8_t)(iv[n] ^ input_buffer[n]);
          iv[n] = output[processed];
        } else {
          uint8_t c = input_buffer[n];
          output[processed] = (uint8_t)(c ^ iv[n]);
          iv[n] = (uint8_t) c;
        }
        n = (n + 1) & 0x0F;
        processed++;
      }

      crypto_management_release(device);
    }
  }

  if (iv_off) {
    *iv_off = n;
  }

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_AES && PSA_WANT_KEY_TYPE_CFB

#if defined(PSA_WANT_KEY_TYPE_AES) && defined(PSA_WANT_ALG_OFB)

/*
 * AES-OFB (Output Feedback Mode) buffer encryption/decryption
 */
static psa_status_t sl_crypto_aes_crypt_ofb(const uint8_t *key_buffer,
                                            size_t key_buffer_size,
                                            size_t length,
                                            size_t *iv_off,
                                            uint8_t iv[16],
                                            const uint8_t *input,
                                            uint8_t *output)
{
  size_t n = iv_off ? *iv_off : 0;

  if (n > 15) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  psa_status_t status;
  uint8_t output_buffer[16] = { 0 };
  uint8_t input_buffer[16] = { 0 };
  size_t processed = 0;

  memcpy(input_buffer, &input[processed], 16);

  while (length--) {
    if (n == 0) {
      status = sl_crypto_aes_crypt_ecb_single(key_buffer,
                                              key_buffer_size,
                                              PSA_CRYPTO_DRIVER_ENCRYPT,
                                              iv,
                                              iv);

      if (status != PSA_SUCCESS) {
        return status;
      }
    }

    output_buffer[processed % 16] = input_buffer[processed % 16] ^ iv[n];

    n = (n + 1) & 0x0F;
    processed++;

    if (processed % 16 == 0) {
      // Update input buffer
      memcpy(input_buffer, &input[processed], 16);
      // Flush output buffer
      memcpy(&output[processed - 16], output_buffer, 16);
    }
  }

  // Flush remaining bytes in output buffer
  memcpy(&output[processed & (~0xF)], output_buffer, processed & 0xF);

  if (iv_off) {
    *iv_off = n;
  }

  return PSA_SUCCESS;
}

