espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_cipher.c
#endif // PSA_WANT_ALG_AES && PSA_WANT_KEY_TYPE_OFB

#if defined(PSA_WANT_KEY_TYPE_AES) && (defined(PSA_WANT_ALG_CTR) || defined(PSA_WANT_ALG_CCM))

/*
 * AES-CTR buffer encryption/decryption
 */
static psa_status_t sl_crypto_aes_crypt_ctr(const uint8_t *key_buffer,
                                            size_t key_buffer_size,
                                            size_t length,
                                            size_t *nc_off,
                                            uint8_t nonce_counter[16],
                                            uint8_t stream_block[16],
                                            const uint8_t *input,
                                            uint8_t *output)
{
  size_t n = nc_off ? *nc_off : 0;
  size_t processed = 0;
  CORE_DECLARE_IRQ_STATE;

  uint8_t output_buffer[16] = { 0 };

  while (processed < length) {
    if (n > 0) {
      // Start by filling up the IV
      output[processed] = (uint8_t)(input[processed] ^ stream_block[n]);
      n = (n + 1) & 0x0F;
      processed++;
    } else {
      // Process one ore more blocks of data
      CRYPTO_TypeDef *device = crypto_management_acquire();
      device->WAC = 0;
      device->CTRL = CRYPTO_CTRL_INCWIDTH_INCWIDTH4;

      CORE_ENTER_CRITICAL();
      CRYPTO_KeyBufWriteUnaligned(device,
                                  key_buffer,
                                  (key_buffer_size == 16U) ? cryptoKey128Bits
                                  : cryptoKey256Bits);
      CRYPTO_DataWriteUnaligned(&device->DATA1, (uint8_t *)nonce_counter);
      CORE_EXIT_CRITICAL();

      // Strategy: encrypt nonce, encNonce xor input -> output, inc(nonce)
      size_t iterations = (length - processed) / 16;
      for (size_t i = 0; i < iterations; i++ ) {
        CORE_ENTER_CRITICAL();
        CRYPTO_EXECUTE_3(device,
                         CRYPTO_CMD_INSTR_DATA1TODATA0,
                         CRYPTO_CMD_INSTR_AESENC,
                         CRYPTO_CMD_INSTR_DATA1INC);

        while ((device->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;

        CRYPTO_DataWriteUnaligned(&device->DATA0XOR,
                                  (uint8_t *)(&input[processed]));

        // Flush the output buffer for each block
        if (processed >= 16) {
          memcpy(&output[processed - 16], output_buffer, 16);
        }

        CRYPTO_DataReadUnaligned(&device->DATA0, output_buffer);
        CORE_EXIT_CRITICAL();

        processed += 16;
      }

      // Create a buffer for the last (partial) input block
      uint8_t input_buffer[16];
      memcpy(input_buffer, &input[processed], 16);

      // Flush the output buffer for the last whole block
      if (processed >= 16) {
        memcpy(&output[processed - 16], output_buffer, 16);
      }

      while (length - processed > 0) {
        if (n == 0) {
          CORE_ENTER_CRITICAL();
          CRYPTO_EXECUTE_3(device,
                           CRYPTO_CMD_INSTR_DATA1TODATA0,
                           CRYPTO_CMD_INSTR_AESENC,
                           CRYPTO_CMD_INSTR_DATA1INC);

          while ((device->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;

          CRYPTO_DataReadUnaligned(&device->DATA0, stream_block);
          CORE_EXIT_CRITICAL();
        }

        // Save remainder to iv
        output[processed] = input_buffer[n] ^ stream_block[n];
        n = (n + 1) & 0x0F;
        processed++;
      }

      // Update nonce counter
      CORE_ENTER_CRITICAL();
      CRYPTO_DataReadUnaligned(&device->DATA1, nonce_counter);
      CORE_EXIT_CRITICAL();

      crypto_management_release(device);
    }
  }

  if (nc_off) {
    *nc_off = n;
  }

  return PSA_SUCCESS;
}

#endif // PSA_WANT_KEY_TYPE_AES && (PSA_WANT_ALG_CTR || PSA_WANT_ALG_CCM)

#endif // defined(CRYPTO_PRESENT)
